{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 1794
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "There are seven more stats to worry about too.\n\n§7Fertilizer§r, §9Water§r, and [warn]Weed-EX[/warn] are all about how much of these is on the crop stick rather than the crop itself. They\u0027re all about how much was applied, and is left of that.\n\n§2Nutrients§r, §1Humidity§r, and §6Air Quality§r are all about the environment. They\u0027re also affected by the Fertilizer and Water stats.\n\nNutrients and Humidity are mostly about the right biome, with swamp and rainforest types (hot+humid) being the best, but you can also get some extra stats by setting up right.\n\n§2Nutrients§r:\n3 possible free points from dirt under the farmland block, 2 for plants that require a specific block. So optimally always make sure that the required block is at the bottommost bottom in the column, because it checks in chain, not certain height. For example: cropstick -\u003e farmland -\u003e dirt -\u003e ore block -\u003e dirt, it will only register 1 dirt, ignoring the one below the oreb block.\n\n5-10 possible points from fertilizing your crops. You can use fertilizer on a crop to increase its nutrient stat. Fertilizer caps at 199 which gives 10 nutrients, but can be applied again only if the crop drops below 100 fertilizer points. So for high stat crops it\u0027s safe to assume and make tests for 100 fertilizer points as it\u0027s a given constant unlike 199-\u003e100 values. You can apply bone meal, IC2 fertilizer and Forestry fertilizer to a crop by hand. Forestry manual orchard multifarm and crop matron does this automatically when supplied with fertilizer (the multifarm needs fertilizer to harvest crops as well).\n\n§1Humidity§r:\n2 free points from using dirt as farmland, as when farmland gets hydrated by water(turns darker) it gains 2 humidity points. This is why other blocks for this suck, since they don\u0027t give this bonus.\n\n10 possible points from hydrating your crop. Similar to fertilizing, water can be applied to crop up to 200 points, which is 10 humidity points, although unlike fertilizer it does not need to drop below value of 100, water can be applied over and over keeping it at constant 200 points. You can apply water to your crop by using IC2 hydration cells by hand, or let your Forestry manual orchard multifarm and crop matron do it automatically. The multifarm needs water to harvest crops as well though.\n\n§6Air Quality§r:\n4 potential free points from empty space around crop. A crop checks for empty spaces to calculate bonus air quality points, it gives up to 4 points, 1 point for each 2 empty spaces. It only counts full blocks or cropsticks though. If you like looks, you\u0027ll probably have to sacrifice this.\n\n4 free points from height of your farm. You get 1 free point every 15 blocks starting at Y79.\n79 - 1 point\n94 - 2 points\n109 - 3 points\n124 - 4 points\n\n2 free points from no opaque blocks above the crop. You can place glass above and you won\u0027t lose the bonus since it\u0027s a transparent block. You cannot use dark glass, several layers of water, or gaseous tenebrae to get around this if your crop likes the dark. Unless you only let it grow at night I guess.\n\n§aGrowability§r:\nYour crop will require a certain level of NHA, try to reach or surpass this, or the crop will either not grow, or even die (disappear). Each crop is different, and higher tiers (and stats) require more. It\u0027s generally easy to meet though, as long as you\u0027re in a good biome.\n\nGrowability is determined by the difference between what the crop needs in terms of NHA, and what it actually has. If you have more than what you need it grows faster. This is why you don\u0027t want a maxed resistance stat, since higher stats will slow it down.",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 345,
        "OreDict:8": "",
        "id:8": "gregtech:gt.blockmachines"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "Even More Stats",
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 2769,
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}