{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 1416
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "TL;DR: The casing amount in this quest is for the best Solar Tower, which generates around 2 LuV amps and is a major Stainless Steel, Titanium and HV circuit sink, amongst other things.\n\nHave you ever laid eyes upon a solar panel? You might have built a few of them here. What do they all have in common, I ask you... they generate either Steam or EU directly from sunlight, and that is not efficient. There\u0027s something that everybody forgot!\n\nSingleblock solar panels are best to insert anywhere that has sun, and provide constant power to a machine. However, EU storage and transport are easy here, so why not build something better? Instead of generating energy directly, send those warm beams of sunlight into a central structure with circles of Solar Reflectors, and bask in the eternal power of the biggest fusion reactor in the Solar System!\n\n(If you end up making a bigger one, don\u0027t come arguing to me about this. Be quiet.)\n\nThe whole idea is that the energy of the Sun\u0027s rays is directed towards a fluid that can retain the energy, a Solar Salt that does it far better than water. The Solar Tower transfers heat to all the fluid inside it, but watch out! If there\u0027s too much cold Solar Salt inside, it will drain away all the heat and slow down the entire process.\n\nIn more detail, the Solar Tower has a heat value that ranges from 0 to 100000, and it only heats up Solar Salt at 30000 or above. The amount of heat gained per cycle depends on the number of Reflectors, but also the current heat value: this process is optimal at exactly half the maximum, so 50000 heat. To get a perfect tower setup, you have to slowly feed cold Solar Salt to maintain this heat value, taking away just enough heat to keep it there. I\u0027ll let you figure out what the flow rate is, given that it depends on how many Reflectors you have.\n\nFrom there, generate Steam or SH Steam by heat-exchanging in the same way as Hot Coolant does it. If you want this setup to truly be optimal, do place it in your personal dimension for permanent daylight.",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 863,
        "OreDict:8": "",
        "id:8": "gregtech:gt.blockmachines"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "I\u0027ll teach you... how to Praise the Sun!",
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 2197724194545617330,
  "questIDLow:4": -6008922449644892285,
  "rewards:9": {
    "0:10": {
      "ignoreDisabled:1": 0,
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 8,
          "OreDict:8": "",
          "id:8": "enhancedlootbags:lootbag"
        },
        "1:10": {
          "Count:3": 30,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "dreamcraft:item.CoinTechnicianII"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 229,
          "Damage:2": 6,
          "OreDict:8": "",
          "id:8": "miscutils:gtplusplus.blockspecialcasings.1"
        },
        "1:10": {
          "Count:3": 60,
          "Damage:2": 8,
          "OreDict:8": "",
          "id:8": "miscutils:gtplusplus.blockspecialcasings.1"
        },
        "2:10": {
          "Count:3": 66,
          "Damage:2": 7,
          "OreDict:8": "",
          "id:8": "miscutils:gtplusplus.blockspecialcasings.1"
        },
        "3:10": {
          "Count:3": 60,
          "Damage:2": 11,
          "OreDict:8": "",
          "id:8": "miscutils:gtplusplus.blockcasings.2"
        },
        "4:10": {
          "Count:3": 340,
          "Damage:2": 864,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockmachines"
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 863,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockmachines"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}