{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 160
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "All your little turbines take up too much space? Are you running out of water? It\u0027s time to solve these problems. This Large Steam Turbine can help you produce a tremendous amount of energy. It will also distill water for you, so you can use the same water again inside your Large Boiler. Don\u0027t forget to make a rotor for the turbine and put inside the controller, otherwise this multiblock won\u0027t do anything.\n\nEach turbine has a specific optimal flow, the Steam flow that gives the highest fuel efficiency, the value shown on the turbine\u0027s tooltip. This is the flow you want to match, and you can use a Fluid Regulator as a cover to make it exactly what you want, but you can go beyond this flow to get an even higher EU/t value, at a loss of fuel efficiency. You can make turbines in 4 different sizes, with larger turbines producing more EU/t, but with varying amounts of fuel efficiency. Generally, Large is the best due to having the highest fuel efficiency and a good optimal flow rate\n\nWhen using turbines, be careful of flow rates. To find the optimal flow rate, you divide the optimal energy flow rate listed on the turbine, by the energy value for the plasma. You can also use the Large Turbine Calculator (there\u0027s a link on the main spreadsheet, which is linked to in discord), or scan the multiblock\u0027s controller while feeding it a minimal amount of plasma to see what the optimal flow is. Make sure to use a Fluid Regulator set to this flow rate for highest fuel efficiency, or go beyond it to get more EU/t at a cost to efficiency, with Steam Turbines being the worst at retaining efficiency beyond the optimal flow.\n\nIf you go beyond the optimal flow, you will get a higher EU/t value, but less fuel efficiency, and the maximum EU/t value depends on the turbine type and its Overflow Efficiency tier. For this type of turbine, tier 1 reaches the max at 150% of optimal flow to produce 112% of the EU/t, tier 2 reaches the max at 200% of optimal flow to produce 133% of the EU/t and tier 3 reaches the max at 250% of optimal flow to produce 156% of the EU/t. The closer you get to this maximum, the more fuel efficiency you\u0027re throwing away. Don\u0027t exceed your dynamo hatch\u0027s maximum EU/t output, though, or you will have problems!\n\nUse NEI with the appropriate long rod to find assembler recipes that will work for you. Or the spreadsheet. Long magnalium for small turbines, long titanium for normal turbines, etc.\n\nPre-moon, the best rotors are Shadow Metal or Vibrant Alloy.\n\nPost-moon, the best HV rotors are Shadow Metal or Oriharukon (this is IV-tier). Luckily, turbines are now fully functional with multi-amp dynamos, so give those a try if you need extra amps!\n\nFor additional choices, see the spreadsheet and Large Turbine Calculator.",
      "globalShare:1": 1,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 1131,
        "OreDict:8": "",
        "id:8": "gregtech:gt.blockmachines"
      },
      "isGlobal:1": 0,
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "§6§lWe Need Big Toys",
      "partySingleReward:1": 0,
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 783,
  "rewards:9": {
    "0:10": {
      "choices:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 5,
          "OreDict:8": "",
          "id:8": "enhancedlootbags:lootbag",
          "tag:10": {
            "ench:9": {
              "0:10": {
                "id:4": 35,
                "lvl:4": 3
              }
            }
          }
        },
        "1:10": {
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "dreamcraft:tile.TripleCompressedCharcoal"
        }
      },
      "ignoreDisabled:1": 0,
      "index:3": 0,
      "rewardID:8": "bq_standard:choice"
    },
    "1:10": {
      "ignoreDisabled:1": 0,
      "index:3": 1,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 2,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "dreamcraft:item.CoinTechnicianII"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 29,
          "Damage:2": 9,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockcasings4"
        },
        "1:10": {
          "Count:3": 1,
          "Damage:2": 51,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockmachines"
        },
        "2:10": {
          "Count:3": 1,
          "Damage:2": 61,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockmachines"
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 170,
          "OreDict:8": "",
          "id:8": "gregtech:gt.metatool.01"
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "2:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 2,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 1131,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockmachines"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}