{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 0
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "Better Questing has a number of useful commands for the questbook (QB). You need to have cheats enabled to use them.\n\n/bq_admin default load\nUse this command to update your QB after you update the modpack. It reloads the quest database from the file. Your save file stores a version of the QB that can be different from the one in the file.\n\n/bq_admin edit\nToggles editing quests. Pressing RMB on the quest will open a context menu to share it or copy its ID.\n\n/bq_admin reset all \u003cPlayer\u003e\nResets all quests. Use this if you want to start over, or are editing the QB. You should specify the player as well if it is a server, otherwise you can skip that part.\n\n/bq_admin reset \u003cID\u003e \u003cPlayer\u003e\nResets a specific quest, defined by the quest ID. Sometimes it may be easier to go into Edit Mode \u003e Designer Tool to specify what to reset.\n\n/bq_admin complete \u003cnumber\u003e \u003cPlayer\u003e\nCompletes a specific quest, similarly to the above. You can still claim the rewards. Use this command if a quest is broken, and then report it on GitHub, but please check if it\u0027s already reported.\n\n/bq_admin default save\nSaves changes to the QB after editing it.\n\n/bq_copyquests \u003cPlayerWithQuestsCompleted\u003e \u003cNewPlayer\u003e\nIf you want to sync the quests with someone in your party, then use this. They won\u0027t get any rewards for that though.\n\n/bq_admin hardcore\nEnables BQ3 Hardcore Mode. You only start with 3 lives, so best of luck. Additional life hearts are available in the Kill all the Things tab.\n\nAside from the consume-type quests, a quest counts for everyone in the party if one person finished it. However, if someone joined your party later, you need to get them up to speed first either through /bq_copyquests above, or manually. Otherwise, your quest completion won\u0027t count for them because the requirements for that quest are not fulfilled for them.\n\nIf your singleplayer world does not have cheats enabled, go to the ESC screen, open to LAN, then enable cheats. This makes pausing impossible until you reload afterwards. If you host a server, you can run the commands in the command line, without \"/\". You can also edit the level.dat file, and set \u0027allowCommands\u0027 to 1, but make sure to backup your world before doing that.\n\n[warn]For quests to save properly, you must be online and logged into your Mojang account when starting the game. Sorry, it\u0027s a limitation of Better Questing.[/warn]",
      "globalShare:1": 1,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": "",
        "id:8": "questbook:ItemQuestBook"
      },
      "isGlobal:1": 0,
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "§9§lBetter Questing?",
      "partySingleReward:1": 0,
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "UNLOCKED"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 1500,
  "rewards:9": {
    "0:10": {
      "ignoreDisabled:1": 0,
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "minecraft:writable_book"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}