{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3236
    },
    "1:10": {
      "questIDHigh:4": -730852476632676945,
      "questIDLow:4": -8284474244884064236
    },
    "2:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2583,
      "type:1": 1
    },
    "3:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2588,
      "type:1": 1
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "Learning more about the world and its ways is a sign of wisdom. However, the truly wise are the ones who know what is unimportant and can be skipped. For a true breacher of technology, the constraints of physics and chemistry are not essential. To skip past their technicalities, the Quantum Force Transformer comes into play.\n\nThis multi is meant to replicate the most popular and important processing lines in the pack\u0027s progression, mostly those related to chemistry. Because of recursion in recipes, where earlier tier materials are required to craft higher tier equivalents, there are a lot of early processing lines that stay up through progression. Even worse, they often need more and more machines to keep up with increasing speed demands. To save on lag, this multi will do those processing lines in one step and without most of the extra chemicals that are added to purify the inputs into the outputs.\n\nThe Quantum Force Transformer (QFT) is unlocked in UEV, after Optical Mainframes have been crafted, and with the addition of a single Eternal Singularity and other materials. It\u0027s a tall, 15x15 multiblock with many different casings, including two that are upgradable and decide the two tiers of the multi. Although it\u0027s available in UEV, the upgraded casings require more and more expensive materials, while also unlocking skips for more advanced processing lines. For example, a platline skip can be done in the earliest QFT tier, whereas a Kevlar skip can only be done in the last tier.\n\nEach recipe that the QFT has represents a single processing line or a big part of a line. The inputs for the early plastic skip, for example, are the basic components of the plastics on a molecular level (Carbon, Hydrogen, Oxygen, etc.), and not the multi-step chemicals that were used half a dozen tiers earlier. All recipes have 3 or more outputs, and every output has a chance to appear: the chance for each is 100% divided by the number of outputs. To increase it, there are additional mechanics that can be used.\n\nSimply put, the QFT uses huge amounts of energy and quantum field stabilization to disassemble simple molecules and assemble them into more complex ones, without needing additives or constrained processes. The only addition to the base inputs that the multi requires is a specific catalyst, which the smart circuits use to guide the materials into what they ultimately transform into, but they are never consumed or lost in any way.\n\nThis direct process simplifies long processing chains to one step, but it has two consequences: it makes the process expensive, given the extreme conditions needed to undergo the transformation (in a similar way to fusion), but it also generates many different outputs at once, none of which are guaranteed, and it\u0027s impossible to choose between them without adding something else into the setup to alter the conditions inside the QFT in some way. Throwing more energy into the multi won\u0027t do anything, and better materials don\u0027t seem to work, so what is the next step? That is what the next two quests will answer.\n\n[note]Tip: Use multiple Bulk Catalyst Housings to run additional QFT recipes within the same structure[/note]",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 31151,
        "OreDict:8": "",
        "id:8": "gregtech:gt.blockmachines"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "Chemical Pseudo-Altercations",
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 3287,
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 80,
          "Damage:2": 12,
          "OreDict:8": "",
          "id:8": "miscutils:gtplusplus.blockcasings.2"
        },
        "1:10": {
          "Count:3": 177,
          "Damage:2": 4,
          "OreDict:8": "",
          "id:8": "miscutils:gtplusplus.blockcasings.4"
        },
        "2:10": {
          "Count:3": 224,
          "Damage:2": 15,
          "OreDict:8": "",
          "id:8": "miscutils:gtplusplus.blockcasings.5"
        },
        "3:10": {
          "Count:3": 236,
          "Damage:2": 7,
          "OreDict:8": "",
          "id:8": "miscutils:gtplusplus.blockcasings.5"
        },
        "4:10": {
          "Count:3": 142,
          "Damage:2": 11,
          "OreDict:8": "",
          "id:8": "miscutils:gtplusplus.blockcasings.5"
        },
        "5:10": {
          "Count:3": 1,
          "Damage:2": 9416,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockmachines"
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 31151,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockmachines"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}