{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 70
    }
  },
  "questIDLow:4": 2161,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "chisel:warningSign",
        "Count:3": 1,
        "Damage:2": 7,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
      "name:8": "§3§lSafety First",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
      "desc:8": "Here are some tips and warnings about electricity. \n\nMachines out in the rain will start fires nearby. Fires next to a machine have a random chance of an explosion. Also, sending a higher voltage than a machine\u0027s tier causes an explosion. Or several of them if they used the same cable. \n\nSending more Amperes than a machine can use is fine. However, if a cable can\u0027t handle that amperage or voltage, it will burn up and start fires that may cause - you guessed it - machine explosions. As a rule of thumb, a cable should be able to carry as much amps as the sum of all generators and emitting buffers connected to it.\n\nA generator that supplies 1A can feed multiple machines if their recipes require less than the full voltage. For example, a Macerator needs only 2 EU/t most of the time, so you could run several of them from a single 1A 32 EU/t generator, if the wires aren\u0027t too long. The wire length matters because there is loss per-amp-per-block, listed on the wire or cable. Cables lose less than wires. Note that sometimes a recipe needs a lot more EU than you expect, like a macerator sand -\u003e quartz dust recipe.\n\nMost machines only use 1A, but there are exceptions; Arc Furnace, Thermal Centrifuge, World Accelerator, and the UUM machines. Machines can accept more amps than they use - usually 2A - in order to top up their internal buffer, especially if they didn\u0027t receive most of the amp because of loss, which is a problem mostly in LV. The formula is (EU/t of Recipe * 2) / Voltage Tier + 1.\n\nSome machines are specifically there to help you deal with multiple amps, such as battery buffers, transformers, and diodes. Check out the quest tab Storing and Transforming EU for more on those.\n\nIf you want to send more amps, use a larger cable or superconductor. Later in the progression, you can use laser hatches to send even more amps, or even a wireless option.\n\nA single block machine starved of EU will restart progress but not lose the recipe items. A multiblock machine §owill§r lose the items.\n\nAny block that emits EU has loss when doing so of 2^(tier-1) per amp. So 1 EU at LV, 2 EU at MV, and so on. Therefore, using large numbers of battery buffers in a row is very wasteful. \n\nThe losses are especially important when you make your first Electric Blast Furnace (EBF) later in LV. Maybe power it directly? Of course, if you want to keep your amps over longer distances, you\u0027ll need to place Battery Buffers (BBs) occasionally to top up the amps, although it is less of a problem the further in progression you get.\n\nPlease refer to §1§n[url]gtnh.miraheze.org/wiki/Electricity[/url]§r for more info."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "miscutils:itemHatTinFoil",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}