{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 70
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "For those new to GregTech, here are some tips and warnings about electricity.\n\nMachines don\u0027t like being out in the rain, and will start fires nearby. Fires next to a machine have a random chance of an explosion. Also, sending a higher voltage than a machine\u0027s tier causes an explosion. Or several, if you pack things together, like many people. Sending more amps than a machine can use doesn\u0027t harm anything though.\n\nSending too high a voltage or too many amps down a cable will cause the cable to burn up and start fires, which may then cause machine explosions. Make sure the number of amps provided by generators and buffers to a cable does not exceed the amps it is capable of carrying.\n\nA generator that supplies 1A can possibly feed multiple machines, if their recipes require less than the full voltage. For example, macerators processing ore only need 2 EU/t, so you could run several from a single 1A generator, as long as the wires aren\u0027t too long. Why does that matter? Because there\u0027s loss for every amp for every block, listed on the wire/cable. Note that cables are better than wires. But be careful! Sometimes a recipe needs a lot more EU than you expect, like a macerator sand -\u003e quartz dust recipe.\n\nMost machines only use 1A, however there are exceptions, such as the arc furnace, thermal centrifuge, world accelerators, and the UUM machines. Note that machines can accept more amps than they use (usually 2) in order to top up their energy supply, especially if they didn\u0027t receive most of the amp because of loss (mostly a problem in LV). The formula is (EU/t of Recipe * 2) / Voltage Tier + 1. Keep this in mind when deciding on cables.\n\nSome machines are specifically there to help you deal with multiple amps, such as battery buffers, transformers, and diodes. Check out the quest tab Storing and Transforming EU for more on those.\n\nIf you want to send more amps, use a larger cable or a superconductor (MV+, but ULV and LV have their own lossless cables). You can use laser hatches much later to send even more. There even are wireless options, but not right now.\n\nA single block machine starved of EU will restart progress but not lose the recipe items. A multiblock machine will lose the items.\n\nNote that any block that emits EU has loss when doing so: 2 ^ (tier-1) per amp. So 1 EU at LV, 2 EU at MV, and so on. Using large numbers of battery buffers in a row is thus very wasteful of your power. You have to be careful with losses when making your first EBF later in LV, maybe rather power them directly? Of course, if you want to keep your amps topped up over longer distances, you\u0027ll need to place BBs occasionally to \u0027top up\u0027 the amps, though this is less the case the further ingame you get, as the loss becomes less of something to worry about.\n\nIf this info isn\u0027t enough for you, head on over to [url]https://wiki.gtnewhorizons.com/wiki/Electricity[/url] to read more.\n\nIf you prefer to learn via video there are also great YouTube resources such as HamCorp\u0027s Electricity Guide: [url]https://www.youtube.com/watch?v\u003dlpDPY8J-4QY[/url]",
      "globalShare:1": 1,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 7,
        "OreDict:8": "",
        "id:8": "chisel:warningSign"
      },
      "isGlobal:1": 0,
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "§3§lSafety First",
      "partySingleReward:1": 0,
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 2161,
  "rewards:9": {
    "0:10": {
      "ignoreDisabled:1": 0,
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "miscutils:itemHatTinFoil"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}