{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 531
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "Tired of looking for ores by hand? Want to find underground oil that will last a long time? A seismic prospector will tell you the ores in the surrounding chunks in a (sorta) handy book you can read, and also the underground fluids beneath you. It doesn\u0027t need to be powered.\n\nTo determine which kind of fluid there is in the chunk you need to scan the soil by right-clicking an Advanced Seismic Prospector with 2 Powderbarrels, 4 Glyceryl Trinitate cells, 8 iTNT or 16 TNT. This one doesn\u0027t explode the user too on use. Features! There are four types of oil or natural gas for the overworld. See the quest in Tips and Tricks once you\u0027ve made an oil drill.\n\n1) Right-click explosives.\n2) Use a single Data Stick to extract the data by right-clicking on it after the animation has finished. Each will hold ONE result.\n3) Next you need to put the data stick in a GT scanner to have it analyzed.\n4) Place the analyzed data stick in the bottom right slot of a printer and add 3 paper in the top left slot and make sure you have at least 144L squid ink in it.\n5) Take the printed pages and combine it with a piece of leather in an assembling machine filled with at least 20 mb of refined glue.\n\n[note]TADA![/note] Now you have a book with detailed info about the chunks you scanned. Visual Prospecting adds the information to your map the moment you make the book.\n\n§2Data Sticks are not easy (or possible) to make right now, so do not lose them.§r You can put it in a crafting table to erase it when done.\n\nOre locations are given as the center of the chunk. Ores that are marginal in that chunk may not be found in the center but on an edge. Look at where ores are located and determine the center of the vein. At higher tiers, it scans more chunks for ores. If you just want to know about fluids, use the lower tier version so the book isn\u0027t as long.\n\nEach underground fluid field is 8x8 chunks. This starts at 0,0 and continues for 8 chunks east and south, containing 64 chunks. Not all fields have anything in them though. Within the field the amount can vary +/- 25 percent. The amount reported in the book is the minimum and maximum per field across all chunks in the field. The prospector reports on 3x3 fields (as in, 9 fields of 8x8 chunks) at all tiers with the center field where the seismic prospector is located. Fluid extraction rate depends on many factors, check the wiki for details. In general, anything above 300 is really good. The total amount in the chunk is complicated.",
      "globalShare:1": 1,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 2102,
        "OreDict:8": "",
        "id:8": "gregtech:gt.blockmachines"
      },
      "isGlobal:1": 0,
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "§5§lAnalyzing the Soil",
      "partySingleReward:1": 0,
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 767,
  "rewards:9": {
    "0:10": {
      "ignoreDisabled:1": 0,
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 4,
          "Damage:2": 32708,
          "OreDict:8": "",
          "id:8": "gregtech:gt.metaitem.01"
        },
        "1:10": {
          "Count:3": 64,
          "Damage:2": 5,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockreinforced"
        },
        "2:10": {
          "Count:3": 1,
          "Damage:2": 4,
          "OreDict:8": "",
          "id:8": "enhancedlootbags:lootbag"
        }
      }
    },
    "1:10": {
      "ignoreDisabled:1": 0,
      "index:3": 1,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 5,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "dreamcraft:item.CoinTechnicianI"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 2102,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockmachines"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}