{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3187
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3191
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "At this point, why not? You should be in a better position to afford it, but there is the issue that t3 fusion unlocks an easier Americium recipe, which lets you craft a second t3 more easily. You might not want to wait that long, maybe you\u0027ve been smelting a lot of ingots, or using World Accelerators?\n\nRegardless, two Helium Plasma reactors will surely suffice for whatever it is you\u0027re doing. Tin Plasma is worth using, of course, but the Molecular Transformer recipe to convert Silver to Tin isn\u0027t available in the singleblock anymore, so you might want the easier option, since you\u0027re rocking two reactors and all. With the 2x overclock they\u0027re still produce millions of EU/t with the right Plasma Turbines, assuming you have them ready.\n\nIf you want to continue expanding, you can look at the Mk2 fusion chain that ends at Runite Plasma. This process uses Force Plasma from the Mk1 fusion chain, so it needs those 5 fusion recipes, plus another 5. Despite being an extremely powerful powergen option, it\u0027s unlikely you need something in this scale right now. Keep in mind, however, that you might need it in UHV or UEV.",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": "",
        "id:8": "appliedenergistics2:tile.BlockDenseEnergyCell",
        "tag:10": {
          "internalCurrentPower:6": 1.6E7,
          "internalMaxPower:6": 1.6E7
        }
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "A Second Reactor?",
      "questLogic:8": "OR",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 3207,
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}