{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 721
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 1511
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "So maybe you can\u0027t find a swamp or tropical forest for your crops or bees, or maybe they\u0027re too far away so they\u0027re inconvenient to get to, or maybe your base is in a colder climate and you have to deal with the howls of direwolves constantly. Instead of packing up all your stuff and moving somewhere else, why not try changing the biome? There are a couple different ways to do so in this modpack:\n\nUse the Arcane Terrestrial Reformer from Witching Gadgets\n-Requires EV Circuits, Tungstensteel, Rocket Tier III\n-Also requires Infusion, Void Metal (sufficient warp), Energized Node for CV, lots of Essentia\n-16 block radius\n-Can only change to a few specific Vanilla or Thaumcraft biomes\n-Kind of slow\n\nUse Ritual of Gaia\u0027s Transformation from Blood Magic\n-Requires Void Metal, Infusion, Tungstensteel\n-Requires getting deep into BM (and the warp that come with it)\n-Requires 1,000,000 LP, Master Blood Orb, Tier 4 Altar and Awakened Activation Crystal\n-10 block radius, can be exactly specified with bloodstone bricks (either type)\n-Cannot specify which biome you get, you can only change the temperature/humidity within the 0.0 - 2.0 range and hope\n-Some biomes may be impossible due to limited range and overlap\n-Adjust temperature/humidity with items on 8 plinths around the Master Ritual Stone\n-Need to relog to see changes\n-Very little documentation or explanation\n-Fast\n\nUse the Brew of Shifting Seasons from Witchery\n-Small range, depends on the level of the brew (power, not dispersal extent)\n-Biome can be exactly specified\n-Crafted using the complicated custom brew system\n-Can add different ingredients to change range of the brew\n-At min changes a single block\n-At max has about a 3 block (circular) radius\n-Instant (once you use it)\n\nUse the Rite of Shifting Seasons from Witchery\n-Requires Stainless Steel, Greatwood Scepter or better for the Distillery\n-You have to do a bunch of Witchery stuff\n-Not hard once you\u0027ve done it once\n-Extremely large range, 16/32/48 block (circular) radius\n-Biome can be exactly specified\n-Sometimes fails in specific chunks\n-Very Fast\n\nIf you want to know how to use the Witchery methods, please go to the Look to the edges tab to continue.\n\nPSA: The IC2\u0026Galacticraft Terraformers only change the surface, not the biome itself.",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 106,
        "OreDict:8": "",
        "id:8": "witchery:ingredient"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "Bringing the Biome to You",
      "partySingleReward:1": 0,
      "questLogic:8": "OR",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 2415,
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}