{
  "questIDHigh:4": 8066762646697952752,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 1545
    }
  },
  "questIDLow:4": -8321971917314713709,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.metaitem.03",
        "Count:3": 1,
        "Damage:2": 32232,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
      "name:8": "Don\u0027t Lose That Multiblock Miner!",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
      "desc:8": "It\u0027s easy to lose Ore Drilling Plants. You\u0027re a busy engineer, you know? You can\u0027t be bothered to remember trifling things like \"where, in what galactic backwater I last placed my miner.\" Now, you could do something boring like \"write down the location of the miner\" or \"put up a sign with the miner\u0027s location in my ore processing area,\" but there\u0027s a better way.\n\nEnter the Metrics Transmitter Cover. This cover, when attached to a multiblock miner (or any GregTech machine,) spawns in a GregTech Advanced Sensor Card paired to the host machine. This card, when inserted into a NuclearCraft Industrial Information Panel, will receive runtime information transmitted by the host machine, including its current location. Additionally, it returns the same information that its lower-tech sibling, the GregTech Sensor Kit, provides. Unlike the GregTech Senor Kit, the Metrics Transmitter Cover §nworks interdimensionally and at any range without the need of range upgrades.§r In addition, since covers remain on machines when they are dismantled, the paired sensor card §nwill continue to work even if the host machine is relocated, and never needs to be recalibrated.§r This makes it perfect for the Ore Drilling Plant and Oil/Gas/Fluid Drilling Rig, which are deployed in the field and often have to be relocated.\n\nHowever, like always, there\u0027s a catch. If the Metrics Transmitter Cover is detached from its host machine, §nthe paired sensor card will be destroyed.§r Maybe you shouldn\u0027t be using a crowbar around sensitive electronics..."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.metaitem.03",
          "Count:3": 1,
          "Damage:2": 32232,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:choice",
      "index:3": 0,
      "choices:9": {
        "0:10": {
          "id:8": "IC2NuclearControl:blockNuclearControlMain",
          "Count:3": 1,
          "Damage:2": 4,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 1,
          "Damage:2": 7,
          "OreDict:8": ""
        }
      }
    }
  }
}