{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 93
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "During your travels you may have seen some huge oil spouts. Now\u0027s the time to make a pump and go collect this black gold into tanks. Oil can be burned directly in a combustion generator (onsite to power the pump, perhaps?) or be refined for better fuels and crafting materials.\n\nBring a generator or battery buffer (with full batteries obviously) with you to power the pump. Thanks to the advancement of technology the pump can auto output on top. Stacking multiple pumps makes them work faster. In that case, oil has to be removed from the bottom of the stack using a pump cover or other means like a conduit.\n\nTaller spouts have more oil. But for the LV pump, it\u0027s better to use the short spouts if possible since it doesn\u0027t have enough range to fully collect the larger ones in the horizontal range. Save the taller spouts for MV or HV pumps.\n\nMining pipes are needed for pumping the oil, same as the auto miner. When it hits the bottom (or something in the way), if there\u0027s no fluid left to collect, it will start retracting the pipes. Same thing if you disable it with a soft mallet. You can also change the range with a screwdriver if there\u0027s a reason to do that, like collecting lava in a limited area faster.\n\nThese are GT machines, so remember to protect them (and their power sources!) from rain on all sides. And set a waypoint with JourneyMaps so you don\u0027t forget where you placed it!\n\n[note]Once you run out of surface oil, you\u0027ll want to turn to:\n1) Oilsands ore, though this is better suited for making heavy oil\n2) Making oil from logs in a pyrolyze oven\n4) Bacterial Vat (EV+)\n5) Crops\n6) Bees\n7) Underground (UG) oil. Dimensions generally have a couple fluids that can be accessed with a multiblock version of the pump, available in MV+[/note]\n\n[note]Heavy oil cannot be used until MV for anything except lubricant and burning in semifluid generator since it requires MV distillery.[/note]",
      "globalShare:1": 1,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": "",
        "id:8": "BuildCraft|Energy:blockOil"
      },
      "isGlobal:1": 0,
      "isMain:1": 1,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "§5§lHello Baron, How\u0027s Your Black Gold Today?",
      "partySingleReward:1": 0,
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 546,
  "rewards:9": {
    "0:10": {
      "ignoreDisabled:1": 0,
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 4,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "BuildCraft|Factory:tankBlock"
        },
        "1:10": {
          "Count:3": 2,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "minecraft:bucket"
        }
      }
    },
    "1:10": {
      "ignoreDisabled:1": 0,
      "index:3": 1,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 3,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "dreamcraft:item.CoinTechnicianI"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 1140,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockmachines"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    },
    "1:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 1,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 64,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "IC2:blockMiningPipe"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}