{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3195
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "An LuV LFTR running on Fuel 3 outputs 4 ZPM amps per tick, or 524,288 EU/t. Each bucket is worth 1,048,576,000,000 EU, more than a trillion EU! Certainly, this is the most power-dense fuel you\u0027ve ever held, and now that you\u0027ve made it here, you can make it to fusion and beyond much more easily. But wait, there\u0027s more!\n\nYou might have noticed that the limiting factor in using the best recipe for Fuel 1 and Fuel 2 was the U Salt, which ultimately makes the LFTR Fuel Base. You just can\u0027t get enough of it to drop that inefficient 4-input recipe. However, the increased output of U Salt from Fuel 3, alongside the doubling that you can get from processing Helium Sparged U Salt instead of the regular one, means that you can use the 2-input recipe to make all your fuel from now on! If you haven\u0027t set up Helium Sparge Towers yet, do so now.\n\nWhen you do this, you can grab the two Fuel Refineries you should have and set them both to the 2-input recipe. Each bucket of Fuel 3 takes 9000 seconds to make, but is consumed in 4000 seconds, so it\u0027s good to have more than one Refinery per LFTR. With this, you will make fuel much faster, and generate much more EU than before. If you continue expanding, it\u0027s very possible to match the first tiers of fusion power from something like this.",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 13,
        "OreDict:8": "",
        "id:8": "miscutils:miscutils.blockcasings"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "Maxed-out LFTR",
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 3197,
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}