{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3098
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "Some setups really demand space in your base to work properly. You might have thought that when you finished the Coke Oven automation, but there\u0027s also an option in this tier that respects that need for speed by just being a gigantic multiblock: the Pyrolyse Oven.\n\nIn essence, it\u0027s the original GregTech large-scale wood processor. It is a massive structure, probably bigger than any other multi you\u0027ve built before, but it uses simple materials like bronze and steel. If you\u0027re able to just throw stacks of those at a controller, you can put this behemoth together and enjoy an alternative to the Advanced Coke Oven that has some extra benefits. Unlike any of the other ovens, this one runs on EU, so you need to route your power back here to process the wood you\u0027re feeding it.\n\nWhat makes the Pyro valuable? It outputs a fluid alongside the Charcoal, which you can process for extra power and/or byproducts. Look at NEI to see all the alternatives available to you, this multi can usually output several different fluids, but only one at a time, decided by the circuit inside it. The one to choose at this time is Wood Tar, the same fluid you\u0027re extracting from the Charcoal. You get a small constant bonus from having built a Pyro, which is really nice.\n\nHowever, the Pyro uses coils in a similar way to the EBF, and those coils affect the time each recipe takes: if you\u0027re using Cupronickel Coils, the recipe time is actually 2x what NEI says! This might be too slow for your needs, so make sure you check how much Charcoal you\u0027re getting from here. Kanthal Coils are available in MV, using the IC2 Coolant instead of the Vacuum Freezer.\n\nYou can also boost your Pyro by providing Nitrogen. There are separate recipes for that in NEI.",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 1159,
        "OreDict:8": "",
        "id:8": "gregtech:gt.blockmachines"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "Pyrolyse Oven",
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 3104,
  "rewards:9": {
    "0:10": {
      "choices:9": {
        "0:10": {
          "Count:3": 2,
          "Damage:2": 5,
          "OreDict:8": "",
          "id:8": "enhancedlootbags:lootbag",
          "tag:10": {
            "ench:9": {
              "0:10": {
                "id:2": 35,
                "lvl:2": 3
              }
            }
          }
        },
        "1:10": {
          "Count:3": 2,
          "Damage:2": 32641,
          "OreDict:8": "",
          "id:8": "gregtech:gt.metaitem.01"
        }
      },
      "ignoreDisabled:1": 0,
      "index:3": 0,
      "rewardID:8": "bq_standard:choice"
    },
    "1:10": {
      "ignoreDisabled:1": 0,
      "index:3": 1,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 3,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "dreamcraft:item.CoinTechnicianI"
        },
        "1:10": {
          "Count:3": 3,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "dreamcraft:item.CoinChemistI"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 1159,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockmachines"
        },
        "1:10": {
          "Count:3": 60,
          "Damage:2": 2,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockcasingsNH"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}