{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3149
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "The most advanced nuclear technology there is to use in the pack is nuclear fusion. This is an event where two atoms collide with each other and fuse into a different atom while simultaneously generating energy from the plasma, when it is processed. It\u0027s impossible to perform in a reactor in real life, because the temperature requirements are too high to maintain any kind of reactor solid with decent efficiency. In GTNH, though, we have better materials.\n\nThe first Fusion Reactor can be built in late LuV, and each tier unlocks some material that is important to progress into the later tiers. Fusion crafting becomes important at that stage, for materials such as Europium, Americium, Neutronium and Oganesson, so you will want to dedicate reactors to specific things later on. More importantly, these materials come out as plasma, which needs to be cooled down to be turned into ingots and plates. On top of that, though, this cooling process is where you can get lots of power!\n\nThe usual process of power generation here is to pump EU into the Fusion Reactor. It needs enough energy to start the reaction, which will then proceed quickly and output good amounts of plasma. This plasma goes into Plasma Turbines, which output huge amounts of EU/t and the cooled down material, ready to be used in further crafting. A beginner\u0027s setup can output 640,000 EU/t from one reactor before overclocking, and this grows quickly over time. Fusion power dominates the game for several tiers due to its simplicity, receding away from the powergen setups that were getting more and more complicated with each tier. Two materials fuse into one, plasma comes out, goes into turbine and boom, lots of energy! It\u0027s like a steam tier powergen but with big numbers.\n\nTo summarize, fusion is required for progression because of the materials it produces. At the same time, it\u0027s very powerful as a source of EU.",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 13,
        "OreDict:8": "",
        "id:8": "gregtech:gt.blockcasings5"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "The Path of Fusion",
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 3152,
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}