{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 1598
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "Sustainability. It\u0027s not the name of the game... but it could be!\n\nIf you\u0027ve ever wanted to generate many chemicals from a single source, you\u0027ve probably looked at Oil or Benzene. However there\u0027s also the Algae Farm. It\u0027s just a pond of sorts, so it doesn\u0027t need power to run. Since it also doesn\u0027t really follow normal recipes, you won\u0027t find any NEI recipe page for the Algae. The multi just produces them on a regular schedule.\n\nThe tier of the multi is given by the casings on the bottom layer of the multi, which all have to match to decide the tier. Each tier from ULV (starting at 50s per batch) till IV (which is 25s per batch) reduces the time it takes to produce Algae by about 5 seconds, and then beyond that each tier will cut the speed in half. Randomly the production speed can either double or triple the time it takes as well, but this happens relatively rarely.\n\nEach tier increase also adds to the amount of Algae you get in a single cycle, as well as the type of Algae produced. Each cycle gives out an exact amount as well as a bonus amount 10% of the time. The Algae Farm also accepts Compost, that you can make from the algae itself, to boost the multi\u0027s tier by one. This might be expensive at the start, but it\u0027s heavily recommended in most cases. You can get regular Algae and Green Algae starting at ULV, Brown Algae starts appearing at HV, Golden-Brown Algae at EV, and Red Algae at IV, though most of the cases where they start appearing they start doing so in very small quantities.\n\nTo find out more about the exact output quantities and timings, please see the wiki: [url]https://wiki.gtnewhorizons.com/wiki/Algae_Farm[/url]\n\nThe Algae can be used for various chemicals like Methane, Ammonia, Sulfuric Acid, Sodium Carbonate, Ethylene, Lithium Chloride, and even some power-generating fluids. You typically need a Chemical Plant for that. In IV tier you can also combine Green Algae with Glowstone to get Glowing Coral and make Sunnarium from that. If you\u0027re curious about all the processing chains, look them up on NEI: quests to cover them are coming up, possibly with more recipes that don\u0027t need the chemplant.",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 997,
        "OreDict:8": "",
        "id:8": "gregtech:gt.blockmachines"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "Algae Pond",
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 1067327358665575267,
  "questIDLow:4": -8996825125550293613,
  "rewards:9": {
    "0:10": {
      "choices:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "miscutils:item.BasicAgrichemItem"
        },
        "1:10": {
          "Count:3": 1,
          "Damage:2": 1,
          "OreDict:8": "",
          "id:8": "miscutils:item.BasicAgrichemItem"
        },
        "2:10": {
          "Count:3": 1,
          "Damage:2": 2,
          "OreDict:8": "",
          "id:8": "miscutils:item.BasicAgrichemItem"
        },
        "3:10": {
          "Count:3": 1,
          "Damage:2": 3,
          "OreDict:8": "",
          "id:8": "miscutils:item.BasicAgrichemItem"
        },
        "4:10": {
          "Count:3": 1,
          "Damage:2": 4,
          "OreDict:8": "",
          "id:8": "miscutils:item.BasicAgrichemItem"
        }
      },
      "ignoreDisabled:1": 0,
      "index:3": 0,
      "rewardID:8": "bq_standard:choice"
    },
    "1:10": {
      "ignoreDisabled:1": 0,
      "index:3": 1,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 2,
          "Damage:2": 5,
          "OreDict:8": "",
          "id:8": "enhancedlootbags:lootbag"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 997,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockmachines"
        },
        "1:10": {
          "Count:3": 64,
          "Damage:2": 15,
          "OreDict:8": "",
          "id:8": "miscutils:gtplusplus.blockcasings.2"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}