{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3287
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "The QFT uses the kind of catalyst that the Chemical Plant also does. However, like the plants that have Awakened Draconium coils or higher, it does not consume the catalyst\u0027s durability on recipe finish, behaving more like a real-life catalyst that is regenerated after being used. This makes the catalysts used here more expensive to craft, as was the case with the Infinite Mutation Catalyst for Mutated Living Solder, which is meant to be used only with those coils that make it last forever.\n\nGiven that there is no durability loss, it would seem only one catalyst needs to be crafted. However, there are two reasons for this to not be true: firstly, each QFT recipe uses a different catalyst; secondly, the QFT checks for parallels by counting the amount of catalysts it has in its Bulk Catalyst Housing for the recipe in question (limit of 2,147,483,647). This system makes it so that crafting 1 of the correct type of catalyst is required to unlock a recipe, but making more is completely optional and only changes the speed at which the multi crafts, provided it gets enough EU input.\n\nEvery catalyst needs some of the materials that it unlocks in the QFT, which is to say, the original processing line will have to be used to craft the catalyst that allows the player to skip it in the QFT. This applies to every recipe, and in turn every line that can be skipped.\n\nTo improve the general speed of processing, your one options is to get more parallels with catalysts. The other, more complicated way is to boost the chances of a successful output by adding more energy to the system, but in a special way: instead of using direct EU, using it to create a powerful plasma works to improve the QFT processing.\n\nIf the correct plasmas are added, the boosting will work, but it is also possible to upgrade the structure itself to perform chemistry skips that are not possible with the base QFT. These upgrades rely on more advanced and powerful materials, mainly in the material progression of DTPF recipes. However, those existing materials are not enough, because the quantum stabilization can\u0027t be maintained with those “foreign” substances. Luckily, the QFT itself can produce the items needed to build the upgraded casings, and these items are outputs of some of the skips performed in the multi. It begins by allowing the much simpler production of already-owned materials but, in this process, it unlocks entirely new materials that are useful to improve the structure itself.\n\nThere are three new items and four tiers in the structure. The first tier can be built without them, but every new tier needs a new item crafted in the tier before. These outputs are related to the recipe where they can be obtained, and they possess unique characteristics that, in real life, are only theoretical.\n\nThe first item you will need to craft is the Hyper-Stable Self-Healing Adhesive. To craft this material, proceed with the Glue/Solder recipe by using the Adhesion Promoter Catalyst. Additionally, make these other catalysts to prove you\u0027re well set in your QFT journey.",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 5,
        "OreDict:8": "",
        "id:8": "Avaritia:Resource"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "Catalyzing Miracles",
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 3289,
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 16,
          "OreDict:8": "",
          "id:8": "miscutils:item.BasicGenericChemItem",
          "tag:10": {
            "catalyst:10": {
              "Damage:4": 0,
              "MaxDamage:4": 50
            }
          }
        },
        "1:10": {
          "Count:3": 1,
          "Damage:2": 17,
          "OreDict:8": "",
          "id:8": "miscutils:item.BasicGenericChemItem",
          "tag:10": {
            "catalyst:10": {
              "Damage:4": 0,
              "MaxDamage:4": 50
            }
          }
        },
        "2:10": {
          "Count:3": 1,
          "Damage:2": 19,
          "OreDict:8": "",
          "id:8": "miscutils:item.BasicGenericChemItem",
          "tag:10": {
            "catalyst:10": {
              "Damage:4": 0,
              "MaxDamage:4": 50
            }
          }
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}