{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 1231
    }
  },
  "questIDLow:4": 940,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 1,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 1172,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
      "name:8": "§6§lCleanroom",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
      "desc:8": "If you want to make more advanced (also cheaper!) circuits you\u0027ll need a cleanroom. The cleanroom is a multiblock between 3x4x3 and 15x15x15 (WxHxL) blocks. Besides plascrete blocks for all edges you\u0027ll need a controller in the top center, filter machine casings for the rest of the top except edges, an energy and a maintenance hatch. You will also need a reinforced door or some other way to get in and out and machine hulls or diodes if you want to automate it. The door, machine hulls, and diodes are optional. You can use the machine hulls for power input, item input, and item output. Tier does not affect item transfer, so use the cheapest ones for that.\n\nLet\u0027s build a 5x5x5 room. Expanding it vertically is easy to do, or you can make it wider and longer, as long as both X and Z match and are odd. Up to around 5% of the plascrete blocks can be replaced with Reinforced Glass to see into the cleanroom and check on machines. Some other glass like Borosilicate Glass or Warded Glass can be used in even higher percentages.\n\nYou can pass materials through the walls using Machine Hulls. You can pass 1A of power using a Machine Hull as well, or you can use Diodes to pass multiple amps through.\n\nJust be really careful when upgrading your machines to a higher voltage. Be sure to remove the machine hulls and diodes and replace them with the new power tier, or else you will be very sad. You don\u0027t need to do this for ones you only use to pass items through.\n\nIf the Cleanroom has maintenance issues, it will have a chance to void recipes needing a cleanroom (10% per maint issue!). Monitor your cleanroom with a Hand Scanner, Industrial Information Panel, or using a Needs Maintenance Cover and a Redstone Powered Light or Howler Alarm.\n\nAdditionally, the longer the door is open or the cleanroom is off, the lower the efficiency will get, which has a direct correlation to recipe voiding. So open the door as little as possible and keep the cleanroom running! There are ways around using a door though. With an elevator or travel anchor you never actually need to open a door or even use one in the structure! You can even use the elevator block or travel anchor as a floor block to neatly integrate it.\n\nThe power usage of this multiblock is a bit unusual. It starts out at 40 eu/t and then gradually goes down. But even when it uses 40 eu/t - which is usually MV - a single LV energy hatch suffices. Just keep in mind that this makes the Cleanroom an exception, not the rule.\n\n§3Multiblocks such as the LCR, LPF, or PA count as cleanrooms, so you don\u0027t need to put them in one. You cannot use the bio lab in a PA, so you\u0027ll still need the cleanroom later on.\n\nOther helpful hints include: using a wireless connector for AE or a transvector interface to skip machine hulls, and that you can use higher tier energy hatches to reach 100% efficiency faster (does not use more power once at 100%).\n\n§4Keep in mind that you cannot use anything in the cleanroom that causes pollution or it will break down."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "minecraft:stone_pressure_plate",
          "Count:3": 2,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "IC2:itemDoorAlloy",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 90,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 41,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 12,
          "OreDict:8": ""
        },
        "3:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 2,
          "Damage:2": 11,
          "OreDict:8": ""
        },
        "4:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 12635,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "2:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 2,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockreinforced",
          "Count:3": 82,
          "Damage:2": 2,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.blockcasings3",
          "Count:3": 8,
          "Damage:2": 11,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "3:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 3,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockmachines",
          "Count:3": 1,
          "Damage:2": 1172,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 2,
          "Damage:2": 6,
          "OreDict:8": ""
        }
      }
    },
    "1:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 1,
      "rewards:9": {
        "0:10": {
          "id:8": "dreamcraft:item.CoinTechnicianII",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}