{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 0
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "Minecraft works in chunks - the 16x16 columns of blocks from bedrock to sky. The chunks in a radius around you are simulated or, in other words, chunkloaded. If a chunk is not loaded, nothing happens in it - crops don\u0027t grow, machines don\u0027t work. Thus, you want to have your base chunkloaded when you\u0027re off exploring. Later on, you want your base chunkloaded so things don\u0027t spontaneously blow up, especially multi-block machines.\n\nYou can chunkload in a few ways:\n\n1) The ServerUtilities mod. With default settings, you will not be able to chunkload. Feel free to change that in the config if you are in singleplayer (SP) or running your own server.\n\n2) Use four types of Anchors from Railcraft, although they are not craftable until the Low Voltage (LV) tier. In SP, or a server you run, cheat in Admin Anchors to chunkload forever, for free. They\u0027re limited on servers to prevent TPS dropping from people chunkloading a base forever when they aren\u0027t even there. On the officials, you need to use Ender Fragments, Ender Pearls, or Coins to fuel them. Look at the tooltip on each for how long it will work, and in what chunkloader.\n\n3) Use one of the blocks that chunkloads itself. If you do this on a server, expect the admins to possibly get very mad at you if it\u0027s not something you\u0027re allowed to do. Same for vanilla methods.\n\nDon\u0027t use chicken chunks to get anchor-like blocks. It\u0027s buggy.",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": "",
        "id:8": "dreamcraft:item.CoinChunkloaderTierI"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "§9§lLoading the Chunks",
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "UNLOCKED"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 2874,
  "rewards:9": {
    "0:10": {
      "ignoreDisabled:1": 0,
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "minecraft:cookie"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}