{
  "preRequisites:9": {},
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "Hello, friend, and welcome to GTNH!\n\nDon\u0027t get used to things being nice and comfy, because in about ten minutes the sun will set, and unlike Vanilla Minecraft, there\u0027s no light whatsoever at night but plenty of Infernal mobs coming to get you. So your first task is to find food and shelter for the night.\n\nBut by the end of this quest tab you will have a bed to make things easier.\n\nYou don\u0027t need to keep this book. Even if you don\u0027t have the item, you can press Tilde (~) to view it at any time...unless you decided to change the keybind.\n\nIf you need any extra help or just want to hang out, feel free to visit our Discord server at [url]https://discord.gg/gtnh[/url]. And yes, the links are clickable! On the Discord, select your tech tier in #role-select - it will help people to tailor their advice to your situation.\n\nMany GTNH topics are explained in our Wiki at [url]https://wiki.gtnewhorizons.com/wiki/Main_Page[/url]. It does not have the same extent and structure as the Questbook, but some things are much better with pictures and tables! The wiki also has tips on extra topics like what additional mods might work with the pack, how GTNH can be installed for modern Java versions or how to set up a server.\n\nAdditionally, there is a spreadsheet at [url]https://www.gtnewhorizons.com/spreadsheet[/url] for the info you would want a spreadsheet for.\n\nIf you play through a launcher that relies on [warn]CurseForge[/warn], be aware that it doesn\u0027t always work properly. It doesn\u0027t play well with all the custom versions of mods that this pack has. So if you have any problems, first switch to another launcher like MultiMC, Prism, or Technic. The wiki has instructions there as well. The latest version of the pack is available on the Discord channel from #announcements or with the !download command.\n\nHopefully you didn\u0027t get munched by a monster while reading this, good luck!",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": "",
        "id:8": "minecraft:wheat"
      },
      "isGlobal:1": 0,
      "isMain:1": 1,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "§9§lYour First Night",
      "partySingleReward:1": 0,
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 0,
  "rewards:9": {
    "0:10": {
      "ignoreDisabled:1": 0,
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "minecraft:apple"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 8,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "minecraft:dirt"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}