{
  "questIDHigh:4": 7843197398684813402,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 1212
    }
  },
  "questIDLow:4": -5758255961960012806,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.metaitem.01",
        "Count:3": 1,
        "Damage:2": 30584,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
      "name:8": "Welcome to the Plasma Chain",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
      "desc:8": "Hello there! If you\u0027ve unlocked fusion, you can start this questline, but keep in mind that it\u0027s divided into three segments (the three fusion chains): one for each tier of Fusion Reactor, from Mk1 to Mk3.\n\nThere is a spreadsheet for all these chains, although it has some reactor count numbers that aren\u0027t right. To see it, check the Excel spreadsheet that set these numbers, in the following Github link:[url]https://github.com/GTNewHorizons/GTplusplus/pull/669[/url]\n\nThese quests follow the process of creating some truly powerful plasmas that are useful for power generation at the beginning of endgame, when you\u0027ve scaled up your setup to a Compact Fusion Reactor and XL Plasma Turbines. As you might have seen before, those huge turbines can go very fast with good materials, like Trinium or Infinity, but they will apply EU/t penalties according to the fuel value of the plasma used. This means that Helium and Tin Plasma are both much weaker there than they were in Large Plasma Turbines.\n\nThe end product of this whole process is Celestial Tungsten Plasma, which has no penalties even at Spacetime and can somewhat match what Helium Plasma would have produced, per compact reactor. The last step is the slowest, but, if there are no other bottlenecks, you can expect around §2§lover 8 billion EU/t§r assuming a single compact doing the last step with huge infinity turbines in a plasma XL.\n\nHowever, getting there won\u0027t be easy. This whole process uses 15 fusion recipes in total, and a lot more material automation than any of the simple fusion setups. This questline will help explain what is simple, not simple, or possibly a bottleneck. If you complete this, you will be sustained in powergen until the Dyson Swarm, or whatever other option appears later on, and it will continue being useful later on!"
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "IC2:itemCellEmpty",
          "Count:3": 64,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}