{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": -5918599008967570585,
      "questIDLow:4": -6232511347414889484
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "Running your Dimensionally Transcendent Plasma Forge for an extended period [note](8 hours)[/note] allows the Multidimensional Spaces to align perfectly.\n\nWith your newly acquired technology, you can now tap into these spaces in perfect sync, enabling your plasma forges to operate at incredible speeds.\n\nThe Transdimensional Alignment Matrix allows the DTPF to run with Perfect Overclocks. To achieve this, you need a full discount, and the extra power cost is offset by using more of the same catalyst.\n\nOverall, it is more efficient and totally worth it.\n\nThis process is extremely catalyst-hungry. Ensure you\u0027re producing enough to sustain it.\n\nFor recipes without a catalyst, you must specify the catalyst in the GUI by right-clicking the Convergence button, otherwise it will default to Crude.[/note]\n\n[note]Math for the curious:\n\nTo clear up what exactly happens in the background, here\u0027s an explanation on how the extra catalyst values are calculated using an example:\n\nThe example recipe of choice is the molten neutronium recipe using prosaic catalyst, running at 64A UMV (8,589,934,592 EU/t).\nThe recipe uses 14,753L of Prosaic catalyst and 36,484,545,600 EU per recipe without OCs or the catalyst discount. With the discount, the catalyst amount gets cut in half, meaning 7,376.5L of catalyst, which are rounded to 7,376L, and due to the 64A UMV the machine is supplied with the recipe overclocks 3 times, meaning each recipe actually uses 36,484,545,600 * 2^3 \u003d 291,876,364,800 EU.\n\nKnowing the amount of OCs and the base voltage of the recipe, the difference of the needed EU per recipe with and without perfect OC can be calculated, that being 291,876,364,800 - 36,484,545,600 \u003d 255,391,819,200 extra EU due to imperfect OCs.\nTo get the value of needed extra catalyst, this extra EU value has to be divided by the energy density of the relevant catalyst, prosaic in this case.\n\nThe division equates to 255,391,819,200 EU / 66,768,460 EU/L \u003d 3,825.037 L, rounded to 3,825L extra prosaic catalyst per recipe. For the final step, this value has to be multiplied by 0.5 as it\u0027s affected by the discount, meaning the total extra catalyst that gets added to the recipe is 3,825L * 0.5 \u003d 1,912.5 L, rounded to 1,912L.\n\nTo summarize it all in a formula:\nAmount extra catalyst per recipe \u003d (B * ((2^x) - 1))/2L\nwhere:\nB is base total EU of the recipe\nx is the number of overclocks\nL is the EU/L of the relevant catalyst [/note]",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 32758,
        "OreDict:8": "",
        "id:8": "gregtech:gt.metaitem.03"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "Convergence",
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 6809780525344965180,
  "questIDLow:4": -7053414737734297359,
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 32758,
          "OreDict:8": "",
          "id:8": "gregtech:gt.metaitem.03"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}