{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": -8913988738481632378,
      "questIDLow:4": -8198041923981670459
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "You should have quite the collection of single block Steam machines by now. While these may have gotten you through processing small amounts of materials, there will be a time when you will have to process a multitude of items. This is where Multiblocks come in.\n\nWhile these Multiblocks have a material cost that is way higher than their single block counterparts, they have certain bonuses: they use less Steam, and they can process recipes in parallel, which means that a single recipe cycle can craft multiple items at once, if the Steam provided is enough to sustain it.\n\n§TThey do however have some quirks that need to be taken care of:\n\n-These Multiblocks require §4§lvery specific§r I/O blocks, use only those that are part of the quest\n-They process up to 8 items, where the Basic Tier is made of Bronze and High Pressure Tier is made of Steel (checkout the Multiblock Preview in NEI which will show you different levels of tiers)\n-The Tier and amount of parallel processing can be seen via WAILA if you are looking at the Controller Block\n\n§W[note]With this quest, you have started your journey with Mass Processing. However, don\u0027t get too excited quite yet. While there are some Multiblocks accessible in the Steam Age, most of them only unlock in EV or later, including better versions of these Multiblocks.[/note]",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 100,
        "OreDict:8": "",
        "id:8": "gregtech:gt.blockmachines"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "STEAM-POWERED BREAKTHROUGH",
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": -6133074755109896107,
  "questIDLow:4": -6003979525766501212,
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}