{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 176
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "Nuclear energy is first available in EV. However, it comes in all shapes and forms, and it can be hard to choose one kind of setup to use amongst all of those that are available. To start this questbook page, this first quest will be a summary of how nuclear power can be produced, and when it is available. Other quests down the line will have more details about each specific setup, but this is an overview of all of them.\n\nTL;DR: Nuke \u003c Fluid Nuke \u003c Vacuum Nuke \u003c LFTR \u003d THTR \u003d Naq Reactor \u003c Fusion \u003c Compact Fusion for power, per reactor. For breeding, Nuke \u003c LFTR \u003d Naq Reactor \u003c HTGR in terms of breeding speed and outputs, with fusion being required to make some materials.\n\nThe first nuclear source you have access to is the Industrialcraft 2 Nuclear Reactor, usually called a nuke. It\u0027s a small singleblock that can have additional chambers attached to it to make a multiblock structure, and the amount of chambers decides the amount of space available for the nuke\u0027s components. Inside it, fuel rods with radioactive materials generate power, and every other item serves to control the temperature of the reactor and keep it from exploding. It generates EU directly, but it can be upgraded to a fluid nuke, which outputs hot coolant instead, for the Large Heat Exchanger, but with more efficiency. Lastly, there\u0027s also the vacuum nuke, which is very similar to regular nukes but it cools down by using Coolant Cells, which wear out and are only reusable by using Vacuum Freezers. Usual fuels for all of these are Thorium, in EV, and Uranium, in IV.\n\nBetween IV and LuV, there\u0027s another kind of reactor, the Liquid Fluoride Thorium Reactor (LFTR). In this large multi, the Thorium and Uranium are mixed with very hot, molten salts (which need to be prepared in another multi), improving the power generation at the cost of additional processing. It\u0027s an expensive setup, but the depleted fuel can be recycled into many more byproducts than usual, especially at LuV, where you can get almost all the noble gases amongst other things, alongside huge amounts of power.\n\nAt those same tiers (albeit mostly for LuV and above), there are also two larger multis, the Thorium High Temperature Reactor (THTR) and the High Temperature Gas-cooled Reactor (HTGR). The THTR is mostly for power, needing an input of about 0.5 IV amps and outputting LuV power at a varied amount of amps, whereas the HTGR is a breeder reactor, outputting 1/20 the amount of hot coolant, which is where the power generation comes from, but with much better ratios for breeding into Lutetium and other elements.\n\nAnother kind of nuclear reactor is the Good Generators Naquadah Reactor, which coincidentally has recipes to consume Thorium Liquid Fuel and Uranium Liquid Fuel, alongside the several types of Naquadah fuel that exist. With these two, this reactor can process those elements much faster than regular nukes, which is helpful for power and for breeding, but it requires more processing until those fuels are ready to be consumed. Additionally, there are fuel rods for the IC2 nukes that use different Thorium and Uranium fuels, more or less related to these.\n\nFrom then on, it\u0027s fusion power. The infamous GregTech Fusion Reactors work by fusing two elements into a new one, which is often a required step for progression, but they also turn the power they require into exponentially more in the way of plasma. Helium and Tin Plasma are some of the most used for power, and putting them into Plasma Turbines is an excellent source of power for lategame, in ZPM to UEV and so on. There are 4 tiers to the regular Fusion Reactors, but there is also compact fusion and some other kinks to fusion that you might explore later on.\n\nThis page will mostly serve to guide you into making a choice between all of these possibilities. It\u0027s pretty much guaranteed that you\u0027ll use at least 2-3 of these setups, so try to get comfortable with these quest descriptions.",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 5,
        "OreDict:8": "",
        "id:8": "IC2:blockGenerator"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "Basis for All Reactors",
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 3145,
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}