{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3157
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "Yes, you can. In fact, you can get it much earlier than EV, but the speed at which you get it can vary wildly, depending on how you approach this problem. Uranium is the main upgrade to Thorium in nukes, with a lot more power to give and a different useful breeding byproduct, but you need about 3 stacks of Uranium 238 to set up the most powerful basic IC2 Uranium Nuke.\n\nHow do you get it, though? The one answer is, you get it from Thorium. Looking at NEI, the Thorium ore processing has a chance to give Uranium dusts, which you can use as fuel, but this happens very slowly, especially considering that Thorium is a rare ore in the Nether, even if each ore block gives 4 crushed dust. The reality seems to be that fast Uranium only happens when you can mine from t2 planets, but this is not the only way. There is a secret, and this secret involves IC2 crops.\n\nHow does it work? Well, it\u0027s simple. The IC2 crop that corresponds to Thorium, the God of Thunder, can quadruple each Crushed Thorium Ore into 4 Purified Thorium Ore, but it also outputs, in fluid form, one Uranium Ingot! This means that each Thorium Ore gives you 4 Uranium Ingots, and with around 42 ore, you can do one cycle of that big reactor setup. God of Thunder needs the ore under it, though, so make sure you save some for that purpose.\n\nEV Uranium nukes are an achievement intended mostly for IC2 crop users, so this quest won\u0027t demand something like that. Still, it\u0027s a useful secret, so here it is. Additionally, the Uranium crop quest in the questbook awards you with 32 Pitchblende when you complete it, which might prove useful for both for quadrupling Uranium and getting Radium for Radon!",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 2098,
        "OreDict:8": "",
        "id:8": "gregtech:gt.metaitem.01"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "Can We Get Uranium Here?",
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 3168,
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 63,
          "Damage:2": 32526,
          "OreDict:8": "",
          "id:8": "gregtech:gt.metaitem.02"
        },
        "1:10": {
          "Count:3": 2,
          "Damage:2": 1096,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockores"
        },
        "2:10": {
          "Count:3": 7,
          "Damage:2": 11098,
          "OreDict:8": "",
          "id:8": "gregtech:gt.metaitem.01"
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 2,
          "Damage:2": 2098,
          "OreDict:8": "",
          "id:8": "gregtech:gt.metaitem.01"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}