{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3164
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3165
    }
  },
  "questIDLow:4": 3206,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 15450,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "OR",
      "repeat_relative:1": 1,
      "name:8": "Establishment of Fusion",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
      "desc:8": "Fusion is the lategame. It is not the entire lategame, but several tiers are effectively relying on it, even if new ways of generating power are being discovered (developed) over time. Whether you got here through focusing on power or products, you have surely felt the importance of that donut on your base, have you not? Let\u0027s just hope your power storage doesn\u0027t run out when you start relying on Mega Blast Furnace processing.\n\nIf you\u0027ve looked at NEI enough, you might have discovered Force Plasma, or some of its crafting steps. This plasma is the end of the first of three fusion chains dedicated to power generation, although some of these special plasmas transform into useful materials in Plasma Turbines or Extreme Heat Exchangers, like Celestial Tungsten later on. There are three of these chains, and the build on top of one another: one for Mk1 Reactors, another for Mk2 and the last for Mk3. \n\nYou can build these chains any time you like, and they offer more EU/t per Fusion Reactor than the Helium Plasma alternative, but it\u0027s unlikely you\u0027ll need them this early. They only become really useful later on, at the Mk3 stage with bigger reactors and turbines. Despite the fact the three plasmas can be used for power, only the final one, Celestial Tungsten, is powerful enough to be worthwhile for your central power generation."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}