{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3190
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "Indium - from Lithium + Silver. This is one of the most important optional fusion recipes, given how difficult Indium is to get. Your options are to either replicate it, make it with fusion, obtain it from the naquadria line, or obtain it from processing sphalerite ore.\n\n(You can make Indium in other ways, of course, but this is a relatively popular, non-forced fusion recipe)\n\nOganesson - from Calcium + Californium. This is the best noble gas of them all, and a very power-hungry recipe compared to most. However, Oganesson will save you power on EBF recipes, reducing recipe time more than any other fluid, and it also boosts Void Miners to their maximum speed. Replicating it might be better, if you have the right setup with GT++ multis.\n\nAmericium - from Hydrogen + Plutonium 241. This is the cheaper Americium recipe that was promised to you in t2, and it no longer needs Lutetium. You should be able to get both of the inputs very easily, so enjoy your cheaper Americium!\n\nNeutronium - from Naquadria + Americium. Neutronium fusion? You probably won\u0027t need to use this, but it is a source other than ores that you can try.",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": "",
        "id:8": "dreamcraft:item.MedalGTExplosion"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "Optional Tier 3 Fusion",
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 3193,
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}