{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3169
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "Red as an ingot, white as a blob. These are the same element, and the same isotope, even if they don\u0027t seem like it.\n\nPlutonium is a major part of nuclear fission reaction, mainly as a product of Uranium fissile fuel, when an atom in the mix captures a neutron and then emits an electron and an anti-neutrino. After several hours in the reactor, the fuel is considered depleted and there\u0027s enough Plutonium in it to separate the two through thermal centrifuging, a basic and inefficient way to do nuclear reprocessing. Later on, it\u0027s possible to improve your methods of handling spent nuclear fuel, but this is the first way you get this nuclear byproduct.\n\nIf you\u0027ve made Quantum Eyes, you might know one of the main uses of Plutonium: to get Radium. By having enough of it to serve as a catalyst in the reaction, you can convert Uranium to Radium in small quantities without losing any Plutonium. Since you need 6 ingots, you will have to do 3 cycles of the setup shown in the quest before this one, or more if you\u0027re running smaller Uranium nukes. However, there is another useful thing you can use this for at this time: more nuclear fuel.\n\nNot just more nuclear fuel, but a different, more complex but also more powerful nuclear fuel. It\u0027s known as MOX fuel, and it is essentially a mix of Uranium and Plutonium. The catch is that all the Plutonium spent on creating the fuel is returned to you when reprocessing the depleted rods, alongside the extra you usually get, but not the Uranium return. To source a nuke of this kind, you will need more than 6 ingots.",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 2100,
        "OreDict:8": "",
        "id:8": "gregtech:gt.metaitem.01"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "Plutonium 239",
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 3172,
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 11100,
          "OreDict:8": "",
          "id:8": "gregtech:gt.metaitem.01"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}