{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3156
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "The previous setup\u0027s EU/t might not have impressed you. You have enough materials to put together the fluid nuke structure, but you want something more than what you\u0027ve seen before. What kind of setup is powerful enough to output several IV amps, and sustain a developed IV base on its own? That sort of setup is shown in this quest, but it requires more multiblocks, and therefore more expense than the previous quest\u0027s chain. The fuel is the same, Uranium, so at this point it\u0027s certainly the least of your worries, until you try to automate the fuel input, at least.\n\nThe components inside the nuke get more and more complicated, so at this point I\u0027m going to ask you to look at the wiki, under the Nuclear Reactors page ([url]https://wiki.gtnewhorizons.com/wiki/Nuclear_Reactors[/url]), and scroll down to the fluid nuke setups, specifically the 1352 HU, 2 Quad Uranium and 1408, 3 Quad Uranium, 1 Dual Uranium ones. The main difference between these two setups is that the first needs Iridium Neutron Reflectors, which are quite expensive if you haven\u0027t done the platline yet, while the second doesn\u0027t use them but is harder to automate due to having more than one type of rod.\n\nWhat\u0027s the final EU/t output, at 170% turbine efficiency? 36288 and 38016 EU/t, respectively.\n\nAfter automating the nuke itself, there is still more to do, though. The LHE is required, as usual, but these setups cause something new to happen: the LHE starts outputting Superheated Steam, due to the high flow of hot coolant that it receives, which means that you need two sets of turbines instead of one. This type of steam must go into Large HP Steam Turbines, which use a good amount of Tungstensteel for the controller and stacks of Titanium for the casings. After those, it goes into the usual Large Steam Turbines, and the process is complete.\n\nThere is yet another new thing to worry about, in case all of this wasn\u0027t enough: the Steam flow is very high, higher than before, which means it\u0027s likely you will need 3 or more of each turbine type, further compounding on the costs you\u0027ll have here.\n\nYour best option for a turbine in the IV tier is the HSS-E at 170% turbine efficiency.\n\nThere is another turbine at 180% efficiency with the HSS-S however; this turbine requires a robust platinum line completed to spare the resources for it.",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": "",
        "id:8": "IC2:blockReactorFluidPort"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "Powering-up Fluid Nukes",
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 3166,
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 8,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "gregtech:gt.rodThorium4",
          "tag:10": {}
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 3,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "gregtech:gt.rodUranium4",
          "tag:10": {}
        },
        "1:10": {
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "gregtech:gt.rodUranium2",
          "tag:10": {}
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "2:10": {
      "index:3": 2,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}