{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3192
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3193
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "It\u0027s not smaller, it\u0027s compact!\n\nCompact Fusion. If you\u0027ve been looking for a big multiblock to put together, you have arrived at a very neat thing. There\u0027s hardly anything that could beat its size, except for a max height Mega Distillation Tower, but this is instead a wide multi instead of a tall one. It is so wide, in fact, that it cannot fit in one chunk, and instead covers a 3x3 chunk space! Make sure you follow the instructions and the hologram properly, and jump in joy when you have one of these built.\n\nYou can choose one of four tiers for this reactor, in the same way as the normal Fusion Reactors. The Compact controller will need 48 of the regular controllers in the same tier, plus some other materials, and more than 2 thousand blocks in the structure, which are conveniently detailed in the tooltip. It is much bigger than the previous reactors, but it also has a huge number of parallels, starting at 64x with MK1 and ending at a maximum of 320x with t5!\n\nThis is the go-to when you have found yourself deep into MK3 fusion, perhaps even MK4, and you find yourself running short on power. Instead of making a tower of reactors, why not make one of these? The only power issue that you\u0027ll have after getting it done is the amount of turbines you will need to eat up all the plasma. You probably know about the XL Plasma Turbine, but you should also know that they force huge penalties on most plasmas, including Helium and Tin, if you use good turbine materials like Infinity. Do you remember those fusion chains mentioned in previous quests? This is the time for them. Check the \"How to Generate Power\" tab for more details.\n\n[note]Compacts follow different overclocking rules, needing double the startup power and double the voltage instead of just the voltage.[/note]",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 32023,
        "OreDict:8": "",
        "id:8": "gregtech:gt.blockmachines"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "Smaller Fusion Is Bigger",
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 3194,
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 32021,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockmachines"
        }
      },
      "taskID:8": "bq_standard:optional_retrieval"
    },
    "1:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 1,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 2,
          "OreDict:8": "",
          "id:8": "GoodGenerator:compactFusionCoil"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}