{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3193
    }
  },
  "questIDLow:4": 3204,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockcasings5",
        "Count:3": 1,
        "Damage:2": 12,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
      "name:8": "The End of Fusion Materials",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
      "desc:8": "There are only so many required fusion materials, which you\u0027ve already gone through at this point. There are many more recipes, many of which have been listed in the quests so far, but also some that are yet to be tackled.\n\nThis, however, is the endgame. If you look at NEI, there are some recipes with EU/T and start EU values that are higher than what t3 fusion can offer, which suggests that there is yet another tier. The reality is that t4 fusion does exist, but it\u0027s more for bragging rights than real usefulness, alongside being much more expensive and harder to make than any of the other reactors. There is a quest for this in the \"Endgame Goals\" page, should you have unlocked that.\n\nAmong the last materials, you will find Flerovium, Rhugnor and, finally, Hypogen. They don\u0027t have a lot of possible uses for most of the pack, but Hypogen becomes essential in the endgame, where it becomes part of the coil block progression, as well as being used in some recipes as wires. If you truly want to walk towards the stargate, you will need to craft many stacks of this."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "gregtech:gt.blockcasings5",
          "Count:3": 1,
          "Damage:2": 12,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {}
}