{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3165
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "Once you upgrade your Fusion Reactor to tier 2, you gain access to a better recipe for power generation, which is Tin Plasma. Helium-3 is used, as it was before, but now with Silver, which you can automate in a million ways. The processing speed is slightly higher than before, but the fuel value of this plasma is much higher than what you were using before, at 150,000,000 EU per bucket. This impressive fuel value means that the max power output of a single t2 reactor at 100% fuel efficiency is 2,700,000 EU/t, and with the turbines you can use here, you can twice as much as that or even more!\n\nTo utilize all of the plasma, you will be using 10 or more turbines with good rotors. Before doing that, though, it\u0027s a good idea to step back and test your turbines with this plasma, preferably in Creative mode, because the fuel value is so high that one liter of plasma is worth 150,000 EU at 100% efficiency. If you set the input rate to anything higher than 2 L/t, you will go above the ZPM Dynamo limit, and even 2 L/t will be too high if the turbine\u0027s efficiency is 174% or above! Until you upgrade your hatches, you might once again be stuck will less power output or efficiency than you\u0027d like. There\u0027s only one way to fix that.",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 31057,
        "OreDict:8": "",
        "id:8": "gregtech:gt.metaitem.01"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "Tin Plasma From T2",
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 3186,
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}