{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3110
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "The Distillation Tower you\u0027ve recently unlocked can bring forth many, many more outputs than what you\u0027ve done so far. If you look at NEI, you might see that there are other Charcoal-related fluids that have recipes in this multi, and this is the time to work with them: doing it all in singleblock Distilleries would be very wasteful.\n\nThe most important part about getting these fluids is the Pyrolyse Oven. If you haven\u0027t made one, it\u0027s highly recommended that you make at least one. You can upgrade both the energy hatch and the coils used in it to keep it up to speed with everything else, no need to build more than one. Aside from fulfilling the purpose of the Coke Oven, to cook Wood into Charcoal, it gives the choice of which of several fluids it also outputs as it does the processing. Most of the options are potentially useful, but a complete Benzene setup will prefer Charcoal Byproducts because they are, essentially, the complete product.\n\nATTENTION: This setup is technically HV, but it\u0027s quite expensive. It\u0027s fine if you move to EV first before you build this. It is in no way required to progress in HV.\n\nWith Charcoal Byproducts, the full setup involves DTing that into Wood Tar, Wood Vinegar and Wood Gas, and then DTing all of those into their respective outputs. With one tower for each, you will end up with a quad DT setup, very expensive overall in terms of Stainless Steel, but with huge savings compared to making 4 separate ones. Keep in mind, however, that they will not all have the same height. Additionally, Wood Gas is not as valuable as the other two (although it is a decent Ethylene source), so it\u0027s also a good idea to make 2 of the 4 DTs process that, and burn the Wood Gas for the little power it can provide.\n\nAs a final note, the towers do process things slowly. Add Distilleries, if you wish, to get specific outputs.",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 30675,
        "OreDict:8": "",
        "id:8": "gregtech:gt.metaitem.01"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "Further Charcoal Distillation",
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 3114,
  "rewards:9": {
    "0:10": {
      "ignoreDisabled:1": 0,
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 32,
          "Damage:2": 11306,
          "OreDict:8": "",
          "id:8": "gregtech:gt.metaitem.01"
        },
        "1:10": {
          "Count:3": 3,
          "Damage:2": 6,
          "OreDict:8": "",
          "id:8": "enhancedlootbags:lootbag",
          "tag:10": {
            "ench:9": {
              "0:10": {
                "id:2": 35,
                "lvl:2": 3
              }
            }
          }
        },
        "2:10": {
          "Count:3": 10,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "dreamcraft:item.CoinTechnicianII"
        },
        "3:10": {
          "Count:3": 5,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "dreamcraft:item.CoinChemistII"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 64,
          "Damage:2": 30675,
          "OreDict:8": "",
          "id:8": "gregtech:gt.metaitem.01"
        },
        "1:10": {
          "Count:3": 3,
          "Damage:2": 1126,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockmachines"
        },
        "2:10": {
          "Count:3": 90,
          "Damage:2": 1,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockcasings4"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}