{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3138
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "If you are invested in making good IV power from Super Fuel, you will need a lot of Turbine multis. Their EU/t at optimal flow is much too low for you to survive with only one or two. However, there are several things you should consider in regards to these turbines, and the fuel you\u0027re using.\n\nIn summary, this fuel is very, very efficient. Turbines can be made faster by losing some efficiency. You have more than enough fuel efficiency to spare!\n\nLet\u0027s review this in more detail. Turbines produce EU based on the flow rate of the fuel that they are consuming. Their optimal flow represents the highest fuel efficiency they can reach (140% or 150% for the good turbines in these tiers), but you can increase the flow beyond that point and still get a higher EU/t value. However, the fuel becomes less efficient. A good tradeoff, if you need it.\n\nSteam loses efficiency quickly if you do this, though. The right way to pull this off with Steam Turbines is to switch to Loose mode, a mode unique to them, which makes the optimal flow shoot way up at a considerable loss to fuel efficiency. The jump in EU/t is so high, however, that you can replace a whole squadron of turbines with just one or two, as you can see if you look at the turbine items\u0027 tooltips.\n\nEach setup has their own details, so you will have to work things out and make personal decisions about how you will manage the turbines. Just make sure to not let the EU/t value go beyond the maximum that the dynamo hatch can output, or you will have problems!",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 1131,
        "OreDict:8": "",
        "id:8": "gregtech:gt.blockmachines"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "Huge Turbines And Loose Mode",
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 3139,
  "rewards:9": {
    "0:10": {
      "ignoreDisabled:1": 0,
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 16393,
          "OreDict:8": "",
          "id:8": "gregtech:gt.metaitem.02"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}