{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 160
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 3141
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "Wood has been a big part of your power generation, and you might have even used other plants or fish for oil. Even if that\u0027s true, there is a constant output from your trees that has been left unused all this time: the saplings! No matter which tree you chose to automate, you are surely stockpiling the saplings matching that tree, since there\u0027s little that is really useful to do with them. At this point, though, you can set up a decent Biomass setup.\n\nTo clarify, Biomass is just a fluid made from plant stuff. It doesn\u0027t need to be saplings, but that\u0027s most likely something you have a lot of lying around. On top of that, there are multiple types of Biomass, one of them called Fermented Biomass, which is very similar but different, and the recommended path for you to take, since it needs fewer steps than the alternatives and gets you to the DT recipe just fine.\n\nAfter this processing line is finished, you will have a lot of new chemicals automated that you won\u0027t have from Wood Tar alone. If you are already processing Wood Vinegar, you will have several repeat outputs, though. That said, if you complete this line, you will get Ethanol + Methanol and Ammonia, which make the Cetane-Boosted Diesel process much easier. All of these lines interact with each other, and you can get bigger and bigger returns if you automate several at once!\n\nFor now, focus on putting together the machines needed to get from Saplings to Fermented Biomass. You will need a Compressor, a Pulverizer and a Pyrolyse Oven for this route.",
      "globalShare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": "",
        "id:8": "BiomesOPlenty:colorizedSaplings"
      },
      "isMain:1": 0,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "Sapling Power",
      "questLogic:8": "OR",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 3109,
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "autoConsume:1": 0,
      "consume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "partialMatch:1": 1,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 243,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockmachines"
        },
        "1:10": {
          "Count:3": 1,
          "Damage:2": 303,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockmachines"
        },
        "2:10": {
          "Count:3": 1,
          "Damage:2": 1159,
          "OreDict:8": "",
          "id:8": "gregtech:gt.blockmachines"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}