{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 2007
    }
  },
  "questIDLow:4": 2699,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.blockmachines",
        "Count:3": 1,
        "Damage:2": 15430,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
      "name:8": "Play it Again, Sam",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
      "desc:8": "So if you thought one Quantum Computer was cool, what about two? You can chain them to get more computing power for your research by connecting them with Optical Connectors the same way you connect to the Research Station. The original QC should have the slave to receive the data from the second one.\n\nOf course, this is kinda expensive, so there\u0027s actually another option, and that\u0027s to simply extend the first one. You can tear down the last two columns of blocks and then use an itemstack of two hologram projectors to see how a 4 computer rack one would be built. However, you\u0027ll need another UV or higher hatch to power it if you use 4 racks, since that will use 5A. You can do the same for up to a 12 stack for 24 computer racks if you want. Just add more of the middle slice, or let a larger stack of hologram projectors show you how it\u0027s done.\n\nIf you use 3 racks with 3 Crystalprocessor Mainframes and 1 Advanced Heat Vent each, you\u0027ll have enough for the UEV circuit, and it won\u0027t overheat either.\n\nA third option for higher computation needs is to finally go back and learn how to set parameters in a useful way. That gives you finer control over the maximum heat your QC reaches and get everything out of it.\n\n§4Remember to let all the heat in your QCs dissipate before changing things."
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}