{
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 15
    }
  },
  "properties:10": {
    "betterquesting:10": {
      "autoClaim:1": 0,
      "desc:8": "More like too many items! Here are some tips for using NEI.\n\nWhen you have your inventory open, you can type the search terms in the text bar at the bottom. Make sure your GUI size is set correctly, or you won\u0027t be able to see it. Double-click the bar to highlight any matching items in your inventory or inventories you\u0027re looking at. Handy for searching for a specific ore, as they tend to look the same!\n\nEven better, you can use T to search nearby inventories, which will emit some particles.\n\nWe have also provided the special Y command to look for a machine in the world, in case you\u0027ve forgotten where you placed that Advanced Circuit Assembler.\n\nWe now have an extra-fancy Bookmark feature! The default key is A, but can be changed in the NEI config window. Bookmarks will be on the left side of the inventory, and you can look up their recipes or uses as normal. To move a bookmark, drag it with Shift+LMB. You can even bookmark entire recipes with Shift+A or recipes with amounts using Ctrl+Shift+A.\n\nPressing O will hide NEI, useful for fancy screenshots.",
      "globalShare:1": 1,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": "",
        "id:8": "minecraft:bookshelf"
      },
      "isGlobal:1": 0,
      "isMain:1": 1,
      "isSilent:1": 0,
      "lockedProgress:1": 0,
      "name:8": "§2§lNot Enough Items - Now with Bookmarks and Recent History!",
      "partySingleReward:1": 0,
      "questLogic:8": "AND",
      "repeatTime:3": -1,
      "repeat_relative:1": 1,
      "simultaneous:1": 0,
      "snd_complete:8": "random.levelup",
      "snd_update:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "questIDHigh:4": 0,
  "questIDLow:4": 1505,
  "rewards:9": {
    "0:10": {
      "ignoreDisabled:1": 0,
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": "",
          "id:8": "dreamcraft:item.CoinAdventure"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}