{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 860
    }
  },
  "questIDLow:4": 2548,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "appliedenergistics2:item.ItemViewCell",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
      "name:8": "Miscellaneous AE Items",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
      "desc:8": "There are several AE items that aren\u0027t particularly useful, but probably deserve mention, so here they are:\n\nCertus Tanks: They hold 32B and are portable and easy to make.\n\nView Cell: Format in a Cell Workbench to filter what you see in a terminal (when they\u0027re installed in it)\n\nCertus/Nether Quartz Cutting Knifes: Right-click to open interface and choose a name. The press can be used in the Inscriber to name stuff without using an anvil. You can also rename p2p tunnels and interfaces in world with the knife.\n\nME Block Container: Holds only one type of item, but the amount of a 64k drive. Can place the item in world, or replace in a 1x1 or 3x3 area. Blocks replaced will be dumped in world. This will be horizontal or vertical depending on which side of a block you select. Shift-right click air to change mode, right click a block to activate mode.\n\nCharged Quartz Fixture: Emits light at the same level as a torch, but fancier.\n\nLight Detecting Fixture: Emits redstone signal based on light. Since it only starts at 7, it\u0027s not as useful as the Light Sensor.\n\nME Upgrade (Tier 1/2/3): If you\u0027re an OC person, there\u0027s 3 upgrades you can make to add access to your network from robots and drones.\nT1: 0.5 access point range\nT2: Normal access point range\nT3: Unlimited range, any dim\n\nEntropy Manipulator: Changes grass/dirt/dried dirt into each other, or starts fires. Or melts ice. Useless.\n\nMatter Cannon: Shoots Matter Balls made in the Matter Condensor. Put it in an ME Chest or Drive and put items in a Terminal to fill. Decent I guess? But it destroys blocks every time you use it, so... Well, I guess you could use it with Paint Balls?\n\nColor Applicator: Use dye items or Paint Balls (more efficient) to dye stuff. You can dye cables, or anything Forge-compatible, like wool or glass. Place items inside like the Matter Cannon. You can cycle through the colors by holding shift and right-clicking, or scrolling the mouse wheel. If you use snow balls, you can remove paint instead. You can also use it in a dispensor.\n\nWalrus: It\u0027s a walrus, what were you expecting?"
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {}
}