{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 127
    }
  },
  "questIDLow:4": 737,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "ProjRed|Core:projectred.core.drawplate",
        "Count:3": 1,
        "Damage:2": 44,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
      "name:8": "Can u eat those?",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
      "desc:8": "No you can\u0027t eat them but you can add them to your routed pipes. Without chips routed pipes can\u0027t do anything on their own, chips also have a GUI to configure them which can be opened by right clicking. \nThere are 8 types of chips:\n\n-Item extractor chip can be used to send items from its inventory to responder, dynamic responder, terminator and overflow responder chips in a pipe network. \n\n-Item responder chip will request items from the extractor chips in your network which match the filter configured to the inventory connected to the responder chip. Chips with higher priority value will receive items first until the inventory is full then will be sent to other inventories with valid filters and remaining space.\n\n-Dynamic item responder chip will request items from the extractor chips in your network that match items inside the dynamic item responder connected inventory. This chip has to be in the same interface pipe as the item responder chip in order to work. Priority rules apply here as well. \n\n-Item overflow responder works exactly the same as the item responder chip, however it only accepts items that cannot go to an item responder chip, dynamic item responder chip, or item terminator chip. \n\n-Item terminator chip works as a backup for responder chips.\n\n-Item broadcaster chip will show you the inventory connected to the routed request pipe on the pipe network and can be used to retrieve items from it. They can also extract from the side you configure. \n\n-Item stock keeper chip will constantly check the network for items and pull them to its pipe. If the chip is set to pull when empty, it will only pull if the inventory next to it is empty, otherwise it will pull when there are less items in the inventory than configured in the chip.\n\n-Item crafting chips craft things. \n\n-Item crafting extension chips are placed inside the item crafting chips. Make sure you randomize the id."
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 0,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "ProjRed|Core:projectred.core.part",
          "Count:3": 4,
          "Damage:2": 44,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:choice",
      "index:3": 0,
      "choices:9": {
        "0:10": {
          "id:8": "IC2:itemPartCircuit",
          "Count:3": 2,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "ProjRed|Core:projectred.core.part",
          "Count:3": 2,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "enhancedlootbags:lootbag",
          "Count:3": 1,
          "Damage:2": 4,
          "OreDict:8": ""
        }
      }
    },
    "1:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 1,
      "rewards:9": {
        "0:10": {
          "id:8": "dreamcraft:item.CoinTechnician",
          "Count:3": 15,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}